**VIDEO 1**

In [2]:
import pandas as pd

In [3]:
datos = {"nombre": ["Mauricio", "Eugenio", "Beatriz"], "edad": [22, 28, 25]}
datos

{'nombre': ['Mauricio', 'Eugenio', 'Beatriz'], 'edad': [22, 28, 25]}

In [4]:
df = pd.DataFrame(datos)
df

     nombre  edad
0  Mauricio    22
1   Eugenio    28
2   Beatriz    25

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df["nombre"]

0    Mauricio
1     Eugenio
2     Beatriz
Name: nombre, dtype: object

In [7]:
df.nombre

0    Mauricio
1     Eugenio
2     Beatriz
Name: nombre, dtype: object

In [8]:
type(df.nombre)

pandas.core.series.Series

**VIDEO 2**

In [9]:
import pandas as pd
df = pd.read_csv('Precipitaciones.csv')
df.head()

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5
2,ALICANTE,49.2,3.7,63.2,85.8,57.2,20.0,9.2,5.0,44.0,41.1,47.4,1.8,427.6
3,ALMERIA,56.3,5.2,35.8,43.1,38.8,16.9,10.2,1.9,17.4,27.3,32.6,3.2,288.7
4,ARABA,96.8,79.9,38.0,52.0,37.7,107.8,8.5,17.7,63.3,38.5,212.2,197.3,949.7

In [10]:
df.head(1)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9

In [11]:
df.tail(1)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
51,ZARAGOZA,52.0,30.0,3.6,52.7,38.3,57.5,13.5,13.2,61.5,27.4,76.6,23.4,449.7

In [12]:
df.shape

(52, 14)

In [13]:
df.columns

Index(['region', 'enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio',
       'julio', 'agosto', 'septiembre', 'octubre', 'noviembre', 'diciembre',
       'anual'],
      dtype='object')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   region      52 non-null     object
 1   enero       52 non-null     float64
 2   febrero     52 non-null     float64
 3   marzo       52 non-null     float64
 4   abril       52 non-null     float64
 5   mayo        52 non-null     float64
 6   junio       52 non-null     float64
 7   julio       52 non-null     float64
 8   agosto      52 non-null     float64
 9   septiembre  52 non-null     float64
 10  octubre     52 non-null     float64
 11  noviembre   52 non-null     float64
 12  diciembre   52 non-null     float64
 13  anual       52 non-null     float64
dtypes: float64(13), object(1)
memory usage: 5.8+ KB

In [15]:
df.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
count,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000
mean,92.996154,78.632692,26.684615,64.500000,38.305769,54.182692,11.840385,17.178846,62.246154,54.373077,82.494231,76.192308,659.626923
std,57.127171,67.454280,31.473913,21.421942,29.079576,36.821635,13.256390,13.939496,28.581205,36.619785,91.689789,80.409042,352.905548
min,26.800000,2.300000,3.300000,3.500000,0.700000,1.100000,0.000000,0.000000,0.900000,1.000000,7.100000,1.800000,108.200000
25%,53.825000,32.825000,9.125000,53.950000,18.875000,26.325000,1.600000,4.850000,46.000000,29.825000,32.375000,22.075000,455.925000
50%,73.950000,62.600000,17.200000,62.700000,35.650000,50.400000,6.150000,16.500000,62.300000,46.550000,46.950000,47.950000,548.550000
75%,97.300000,102.550000,35.425000,77.625000,48.750000,78.025000,17.875000,26.550000,81.625000,74.500000,102.725000,107.000000,665.150000
max,261.900000,335.700000,209.800000,128.400000,149.500000,145.000000,46.800000,57.000000,122.800000,175.700000,384.600000,314.700000,1575.400000

In [16]:
serie = df["region"]
serie.head()

0    A CORUNA
1    ALBACETE
2    ALICANTE
3     ALMERIA
4       ARABA
Name: region, dtype: object

In [17]:
arreglo = [0,1,2,3,4,5,6,7,8,9]
miSerie = pd.Series(arreglo)
miSerie

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [18]:
indices = ["Posicion 0", "Posicion 1", "Posicion 2", "Posicion 3", "Posicion 4", "Posicion 5", "Posicion 6", "Posicion 7", "Posicion 8", "Posicion 9"]
miSerie = pd.Series(arreglo, indices)
miSerie

Posicion 0    0
Posicion 1    1
Posicion 2    2
Posicion 3    3
Posicion 4    4
Posicion 5    5
Posicion 6    6
Posicion 7    7
Posicion 8    8
Posicion 9    9
dtype: int64

In [19]:
type(miSerie)

pandas.core.series.Series

In [20]:
type(miSerie["Posicion 0"])

numpy.int64

In [21]:
cities = {"Mexico": "CDMX", "EUA": "Washington DC", "Canada": "Ottawa"}
atributo = pd.Series(cities)
atributo

Mexico             CDMX
EUA       Washington DC
Canada           Ottawa
dtype: object

**VIDEO 3**

In [22]:
import pandas as pd

In [23]:
serie = pd.Series([1,2,3,4,5])
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
serie[0] = serie[0] + 5
serie

0    6
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
serie = serie * 5
serie

0    30
1    10
2    15
3    20
4    25
dtype: int64

**VIDEO 4**

In [26]:
import pandas as pd

data = {"idProducto":[1001,1002,1003,1003],
       "cantidadVendida": [30, None, 25, 25],
       "Precio": [20.5, 15.0, None, 22.5]}

df = pd.DataFrame(data)
df

   idProducto  cantidadVendida  Precio
0        1001             30.0    20.5
1        1002              NaN    15.0
2        1003             25.0     NaN
3        1003             25.0    22.5

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   idProducto       4 non-null      int64
 1   cantidadVendida  3 non-null      float64
 2   Precio           3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [28]:
df.isnull()

   idProducto  cantidadVendida  Precio
0       False            False   False
1       False             True   False
2       False            False    True
3       False            False   False

In [29]:
df.isnull().sum()

idProducto         0
cantidadVendida    1
Precio             1
dtype: int64

In [30]:
df_eliminados = df.dropna()
df_eliminados

   idProducto  cantidadVendida  Precio
0        1001             30.0    20.5
3        1003             25.0    22.5

In [31]:
valoresNuevos = {"cantidadVendida": 0, "Precio":df["Precio"].mean()}
df_rellenados = df.fillna(valoresNuevos)
df_rellenados

   idProducto  cantidadVendida     Precio
0        1001             30.0  20.500000
1        1002              0.0  15.000000
2        1003             25.0  19.333333
3        1003             25.0  22.500000

In [32]:
df_rellenados["cantidadVendida"] = df_rellenados["cantidadVendida"].astype(int)
df_rellenados

   idProducto  cantidadVendida     Precio
0        1001               30  20.500000
1        1002                0  15.000000
2        1003               25  19.333333
3        1003               25  22.500000

In [34]:
df_unicos = df_rellenados.drop_duplicates(subset="idProducto")
df_unicos

   idProducto  cantidadVendida     Precio
0        1001               30  20.500000
1        1002                0  15.000000
2        1003               25  19.333333

**VIDEO 5**

In [35]:
import pandas as pd

serie = pd.Series([5,10,15,20,25])
serie

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [36]:
filtro = serie > 15
serie_filtrada = serie[filtro]
serie_filtrada

3    20
4    25
dtype: int64

In [37]:
filtro

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [38]:
serie2 = pd.Series(["banana", "pera", "melon", "manzana"])
serie2

0     banana
1       pera
2      melon
3    manzana
dtype: object

In [39]:
type(serie2)

pandas.core.series.Series

In [40]:
type(serie2[0])

str

In [41]:
print(dir(serie2))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__column_consortium_standard__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__firstlineno__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__static_attributes__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_attrs', '_binop', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_expanddim_from_mgr', '_constructor_from_mgr', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_duplicated', '_find_valid_index', '_flags', '_flex_method', '_from_mgr', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_index_resolvers', '_get_label_or_level_values', '_get_numeric_data', '_get_rows_with_mask', '_get_value', '_get_values_tuple', '_get_with', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_item_cache', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_update_cacher', '_memory_usage', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_references', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_shift_with_freq', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'case_when', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'interpolate', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'list', 'loc', 'lt', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'std', 'str', 'struct', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [43]:
help(serie2.std)

Help on method std in module pandas.core.series:

std(
    axis: 'Axis | None' = None,
    skipna: 'bool' = True,
    ddof: 'int' = 1,
    numeric_only: 'bool' = False,
    **kwargs
) method of pandas.core.series.Series instance
    Return sample standard deviation over requested axis.

    Normalized by N-1 by default. This can be changed using the ddof argument.

    Parameters
    ----------
    axis : {index (0)}
        For `Series` this parameter is unused and defaults to 0.

        .. warning::

            The behavior of DataFrame.std with ``axis=None`` is deprecated,
            in a future version this will reduce over both axes and return a scalar
            To retain the old behavior, pass axis=0 (or do not pass axis).

    skipna : bool, default True
        Exclude NA/null values. If an entire row/column is NA, the result
        will be NA.
    ddof : int, default 1
        Delta Degrees of Freedom. The divisor used in calculations is N - ddof,
        where N represents the number of elements.
    numeric_only : bool, default False
        Include only float, int, boolean columns. Not implemented for Series.

    Returns
    -------
    scalar or Series (if level specified)

    Notes
    -----
    To have the same behaviour as `numpy.std`, use `ddof=0` (instead of the
    default `ddof=1`)

    Examples
    --------
    >>> df = pd.DataFrame({'person_id': [0, 1, 2, 3],
    ...                    'age': [21, 25, 62, 43],
    ...                    'height': [1.61, 1.87, 1.49, 2.01]}
    ...                   ).set_index('person_id')
    >>> df
               age  height
    person_id
    0           21    1.61
    1           25    1.87
    2           62    1.49
    3           43    2.01

    The standard deviation of the columns can be found as follows:

    >>> df.std()
    age       18.786076
    height     0.237417
    dtype: float64

    Alternatively, `ddof=0` can be set to normalize by N instead of N-1:

    >>> df.std(ddof=0)
    age       16.269219
    height     0.205609
    dtype: float64

In [44]:
filtro2 = serie2.str.contains("m")
filtro2

0    False
1    False
2     True
3     True
dtype: bool

In [45]:
serie2[filtro2]

2      melon
3    manzana
dtype: object

**VIDEO 6**

In [46]:
import pandas as pd

numeros = pd.Series([10, 20, 30, 40, 50])
numeros

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [47]:
promedio = numeros.mean()
print(f"El promedio es {promedio}")

El promedio es 30.0

In [48]:
total = numeros.sum()
total

np.int64(150)

In [49]:
maximo = numeros.max()
maximo

np.int64(50)

In [50]:
minimo = numeros.min()
minimo

np.int64(10)

**VIDEO 7**